#4. Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь результат. 
#Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, обробляє повернутий ними результат та також повертає результат. 
#Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3

def show_tree():
    picture = [
  [0,0,0,1,0,0,0],
  [0,0,1,1,1,0,0],
  [0,1,1,1,1,1,0],
  [1,1,1,1,1,1,1],
  [0,0,0,1,0,0,0],
  [0,0,0,1,0,0,0]
 ]




    for image in picture:
        for pixel in image:
           if (pixel):
              print('*', end ="")
           else:
              print(' ', end ="")
        print(' ')


def pass_all():
    print('-------')



def grass():
    print('########')


def all_function():
    pass_all()
    show_tree()
    grass()


all_function()