#Користувачем вводиться початковий і кінцевий рік. Створити цикл, який виведе всі високосні роки в цьому проміжку (границі включно).
#Пояснення  до завдання №2: високосний рік - це рік, який відповідає одному з двох наступних стверджень:
#рік кратний 400
#рік кратний 4, але не кратний 100
#Тобто, 2000 - високосний, бо, хоч він і не відповідає умові №2, але відповідає умові №1.
#Примітка: кратний - це коли остача від ділення дорівнює нулю. (edited) 

a = int(input('Input start range of year:'))
b = int(input('Input end range of year:'))
for i in range(a,b+1):
    if not i % 4 and i % 100 or not i % 400: 
        print(i)
 
